Repository: dmt947/harmoniq
Catalog: lib/l10n/app_*.arb
Languages: es

# midiEditorTab
source: MIDI Editor
es: Editor MIDI

# aiFeaturesTab
source: AI Features
es: Funciones IA

# settingsTab
source: Settings
es: Ajustes

# helloUser
source: Hello, {userName}
es: Hola, {userName}

source: YOUR PROJECTS
es: TUS PROYECTOS

# noProjectsYet
source: No projects yet. Create one!
es: Aún no hay proyectos. ¡Crea uno!

source: Create Project
es: Crear Proyecto

source: Project Name
es: Nombre del Proyecto

source: Save Settings
es: Guardar Ajustes

# savedSettings
source: Project settings saved!
es: ¡Ajustes del proyecto guardados!

# profileScreenTitle
source: User Profile
es: Perfil de Usuario

# editProfileButton
source: Edit Profile
es: Editar Perfil

# profileEditUnavailableTitle
source: This feature is under development or temporarily disabled.
es: Esta función está en desarrollo o temporalmente deshabilitada.

# profileEditUnavailableMessage
source: Profile editing is not available for now.
es: La edición de perfil no está disponible por ahora.

# midiEditorPlayButton
source: Play
es: Reproducir

# midiEditorStopButton
source: Stop
es: Detener

source: Delete note
es: Eliminar nota

source: Move note
es: Mover nota

source: Change duration
es: Cambiar duración

# noteOverlapError
source: There's an overlap, you can't do that.
es: Hay una superposición, no puedes hacer eso.

# dragNoteBody
source: Drag the note body to move it
es: Arrastra el cuerpo de la nota para moverla

# dragNoteHandle
source: Drag the right edge of the note to change its duration
es: Arrastra el borde derecho de la nota para cambiar su duración

# playerPlaying
source: Playing: "{projectName}"
es: Reproduciendo: "{projectName}"

# projectCreated
source: {projectName} has been created
es: {projectName} ha sido creado

# deleteProjectConfirmTitle
source: Delete project
es: Eliminar proyecto

# deleteProjectConfirmContent
source: Are you sure you want to delete "{projectName}"?
es: ¿Seguro que quieres eliminar "{projectName}"?

source: Cancel
es: Cancelar

source: Delete
es: Eliminar

# projectDeleted
source: Project "{projectName}" deleted.
es: Proyecto "{projectName}" eliminado.

# newProjectTitle
source: New Project
es: Nuevo Proyecto

# projectNameEmptyError
source: Project name cannot be empty.
es: El nombre del proyecto no puede estar vacío.

source: Create
es: Crear

source: Musical Genre
es: Género Musical

# timeSignature
source: Time Signature (e.g. 4/4)
es: Compases (ej. 4/4)

# aiChatHint
source: Write your AI prompt...
es: Escribe tu prompt para la IA...

# loginButton
source: Login
es: Iniciar sesión

# loginWithGoogleButton
source: Login with Google
es: Iniciar sesión con Google

# logoutButton
source: Logout
es: Cerrar sesión

# noAccount
source: Don't have an account?
es: ¿No tienes cuenta?

# emailPlaceholder
source: Email
es: Correo electrónico

# passwordPlaceholder
source: Password
es: Contraseña

# usernamePlaceholder
source: Username
es: Nombre de Usuario

# confirmPasswordPlaceholder
source: Confirm password
es: Confirmar contraseña

# alreadyHaveAccount
source: Already have an account?
es: ¿Ya tienes cuenta?

# createAccountTitle
source: Create a new account
es: Crea una cuenta nueva

# allFieldsRequired
source: Please complete all fields
es: Completa todos los campos

source: Passwords do not match
es: Las contraseñas no coinciden

# registerButton
source: Register
es: Registrarme

# trackName
source: Track
es: Pista

source: Add Track
es: Añadir Pista

source: Delete Track
es: Eliminar Pista

# deleteTrackConfirmTitle
source: Delete track?
es: ¿Eliminar pista?

# deleteTrackConfirmMessage
source: Are you sure you want to delete this track? This action cannot be undone.
es: ¿Estás seguro de que quieres eliminar esta pista? Esta acción no se puede deshacer.

source: OK
es: Aceptar

# trackDeleted
source: Track deleted successfully.
es: Pista eliminada correctamente.

# playButton
source: Play
es: Reproducir

# stopButton
source: Stop
es: Detener

# unknownGenericError
source: An unexpected error occurred
es: Ocurrio un error inesperado

# accountExistsWithDifferentCredential
source: An account already exists with a different credential
es: Ya existe una cuenta con otro método

# invalidCredential
source: Invalid credential, please try again
es: Credencial inválida, intenta de nuevo

# unknownSignInError
source: Error signing in
es: Error al iniciar sesión

# unknownSignUpError
source: Error signing up
es: Error al registrarse

source: User not found
es: Usuario no encontrado

# wrongPassword
source: Incorrect password, please try again
es: Contraseña incorrecta, intenta de nuevo

source: Invalid email
es: Correo inválido

# invalidPassword
source: Password must be more than 6 characters
es: La contraseña debe tener mas de 6 caracteres

# emailAlreadyInUse
source: The email has already been registered
es: El correo ya ha sido registrado

# authMissingFields
source: You must provide an email and password
es: Debes proporcionar un correo y contraseña

# addMelodyButton
source: Add a melody or arrangement
es: Añadir una melodía o arreglo

# replaceMelodyButton
source: Replace Melody
es: Reemplazar Melodía

# transformMelodyButton
source: Transform Melody
es: Transformar Melodía

# generateNotesFailed
source: AI could not generate valid notes. Try a different prompt.
es: La IA no pudo generar notas válidas. Intenta con un prompt diferente.

# notesAddedSuccess
source: Notes generated and added successfully.
es: Notas generadas y añadidas correctamente.

# melodyReplacedSuccess
source: Melody replaced successfully.
es: Melodía reemplazada correctamente.

# melodyTransformedSuccess
source: Melody transformed successfully.
es: Melodía transformada correctamente.

# apiError
source: Error communicating with AI: {error}. Please try again.
es: Error al comunicarse con la IA: {error}. Intenta de nuevo.

# noInputError
source: Please write a prompt.
es: Por favor, escribe un prompt.

source: Generating notes...
es: Generando notas...

# addLayerPrompt
source: Generate a {promptDescription} that complements this melody.
es: Genera una {promptDescription} que complemente esta melodía.

# replaceMelodySpecificPrompt
source: Generate a new melody of {promptDescription}.
es: Genera una nueva melodía de {promptDescription}.

# transformMelodySpecificPrompt
source: {promptDescription} this melody.
es: {promptDescription} esta melodía.

# generalChatButton
source: General Chat
es: Chat General

# generalChatHint
source: Write a message for the AI...
es: Escribe un mensaje para la IA...

# addLayerHint
source: Describe the layer to add (e.g. "funky bass line", "string arrangement").
es: Describe la capa a añadir (ej. "línea de bajo funky", "arreglo de cuerdas").

# replaceMelodyHint
source: Describe the new melody (e.g. "a cheerful pop melody", "a jazz piano melody").
es: Describe la nueva melodía (ej. "una melodía pop alegre", "una melodía de piano jazz").

# transformMelodyHint
source: Describe the transformation (e.g. "transpose it to D minor", "make it sadder", "in blues key").
es: Describe la transformación (ej. "transpónla a re menor", "hazla más triste", "en clave de blues").

# noNotesToTransformError
source: There are no notes on the track to transform. Add some first.
es: No hay notas en la pista para transformar. Añade algunas primero.

# noResponseFromAI
source: The AI could not respond correctly. Please try again.
es: La IA no pudo contestar correctamente. Por favor intenta otra vez

# aiResponded
source: AI responded in chat
es: La IA contesto en el chat

# minSubdivisionPlaceholder
source: Minimum Subdivision
es: Subdivisión Mínima

# changedInstrument
source: Instrument changed to: {instrumentName}
es: Instrumento cambiado a: {instrumentName}

# firebaseUnauthenticatedUserException
source: Unauthenticated user. Cannot access project collection.
es: Usuario no autenticado. No se puede acceder a la colección de proyectos.

# notAuthenticated
source: You must log in to save projects.
es: Debe iniciar sesión para guardar proyectos.

# settingsTitle
source: Settings
es: Ajustes

# themeSettings
source: Configure theme
es: Configurar tema

# themeSystem
source: System theme
es: Tema del sistema

# themeDark
source: Dark theme
es: Tema oscuro

# themeLight
source: Light theme
es: Tema claro

# languageSettings
source: Configure language
es: Configurar idioma

# languageSystem
source: System language
es: Idioma del sistema

# userProfile
source: User Settings
es: Configuración de Usuario

source: View/Edit Profile
es: Editar perfil

# appInfo
source: App Information
es: Información de la Aplicación

source: Version
es: Versión

# unsavedChangesTooltip
source: You have unsaved changes
es: Tienes cambios sin guardar

# projectSavedNotificationTitle
source: Project uploaded successfully
es: Proyecto subido correctamente

# projectSavedNotificationBody
source: Your project {projectName} has been uploaded successfully
es: Tu proyecto {projectName} ha sido subido correctamente

# saveReminderNotificationTitle
source: Don't lose your changes!
es: No vayas a perder tus cambios!

# saveReminderNotificationBody
source: Remember to save your changes for {projectName} so you don't lose them
es: Recuerda guardar los cambios de {projectName} para no perderlos

# keepWorkingNotificationTitle
source: Keep creating amazing music!
es: Sigue creando musica increible!

# keepWorkingNotificationBody
source: Continue working on {projectName}!
es: Continua trabajando en {projectName}!
